
# dependency for oh-my-zsh plugins
robbyrussell/oh-my-zsh
# press ESC ESC to repeat a command with sudo
robbyrussell/oh-my-zsh path:plugins/sudo
# tab completion for git
robbyrussell/oh-my-zsh path:plugins/git-extras
# zoxide hooks for zsh
robbyrussell/oh-my-zsh path:plugins/zoxide
# tab completion for nvm
robbyrussell/oh-my-zsh path:plugins/nvm
# integrate fzf in zsh
# override Ctrl+R to use fzf
# alt+c - list directories in pwd then cd into selected one
# ctrl+t - search current directory and insert the selected file path in the prompt
robbyrussell/oh-my-zsh path:plugins/fzf

# prompt theme
romkatv/powerlevel10k

# suggest a matching previous command as you type
zsh-users/zsh-autosuggestions
# more tab completions (one day I should include only what I use)
zsh-users/zsh-completions
# syntax highlighting on the prompt
zsh-users/zsh-syntax-highlighting
# direnv hooks for zsh
ptavares/zsh-direnv

# add a clip command, it copies what it gets in stdin to the clipboard or outputs the clipboard to stdout
# $ echo hello | clip; clip | cat # prints 'hello'
zpm-zsh/clipboard

# add a jq integration to filter the json output of a program with jq, type the command and then press alt+j
reegnz/jq-zsh-plugin

# add hooks into zsh so that it shows a notification when a long running (15 seconds) process ends
kevinywlui/zlong_alert.zsh

# use zsh when running `$ nix-shell`
chisui/zsh-nix-shell
